How to Configure Logictech 502 Game Mouse with Piper
----------------------------------------------------
Problem:  Your Logitech 502 Game Mouse glows in Linux and you want to stop the glowing
SolutioN: Use Piper

Assumptions:
 A) You have anaconda python3 installed here:  /opt/anaconda3
 B) You have anaconda python3 in your path


PROBLEM -- I CANNOT COMPILE LABRATG because I don't have the latest version of systemd

References
----------
https://github.com/libratbag/piper


Procedure
---------
 1. Install meson (requires python 3.5)
    unix> sudo /opt/anaconda3/bin/conda install -c conda-forge meson 
          or
          sudo /opt/anaconda3/bin/pip install meson

 2. Instal libevdev and libevdev development files
    unix> sudo yum install libevdev libevdev-devel

 3  Upgrade your files
    NOTE:  I needed this to update systemd.  And, I did not want to upgrade only systemd
    unix> sudo yum upgrade

 4. Compile and install ratbagd  [libevdev and libevdev-devel]
    unix> cd /tmp
    unix> git clone https://github.com/libratbag/libratbag.git
    unix> cd libratbag
    unix> vi meson_options.txt
          option('systemd-unit-dir',
             type : 'string',
             value : '/usr/lib/systemd/system',
             description : 'systemd unit directory [default=$libdir/systemd/system]')


    HACK:  I had to modify the meson.build to make it work:
    unix> vi meson.build
      a) comment-out this line
                 dependency('python3'),

      b) change this line to use systemd 219
           dep_libsystemd = dependency('libsystemd', version : '>=227')
         to this:
           dep_libsystemd = dependency('libsystemd', version : '>=219')

      c) Change this
           dep_check = dependency('check', version: '>= 0.9.10')
              To this:
           dep_check = dependency('check', version: '>= 0.9.9')

   unix> meson builddir --prefix=/usr/

   DOES NOT COMPILE



 5. Compile and install piper
    unix> cd /tmp
    unix> git clone https://github.com/libratbag/piper.git
    unix> cd piper
    unix> meson builddir --prefix=/usr/


