How to Setup a Syslog Client on Centos 7
----------------------------------------
Problem:  You want to push your syslog events to an internal server

References
----------
https://www.itzgeek.com/how-tos/linux/centos-how-tos/setup-syslog-server-on-centos-7-rhel-7.html
https://www.loggly.com/docs/rsyslog-tls-configuration/


Procedures
----------
 1. Get the hostname and port of the syslog server that you are sending records to
 
 2. Verify that you can connect to it
    unix> telnet <syslog_server_host> <syslog_server_port>
    
 3. Install rsyslog
    unix> sudo yum install rsyslog
 
 4. Install rsyslog TLS utilities
    unix> sudo yum install rsyslog-gnutls
    
 5. Get the CA Certs from your administrator
    Copy the keys to here:  /etc/rsyslog.d/keys/G2-CA-Bundle.pem
    unix> sudo mkdir -p /etc/rsyslog.d/keys
    unix> sudo cp /tmp/CA-Bundle.pem /etc/rsyslog.d/keys
    
 6. Create this file:  /etc/rsyslog.d/22-greylog.conf
    unix> sudo vi /etc/rsyslog.d/22-greylog.conf

    ################################################################
    # Configuration to push syslog events to syslog_server
    ################################################################

    # Setup disk assisted queues
    $WorkDirectory /var/spool/rsyslog # where to place spool files
    $ActionQueueFileName fwdRule1     # unique name prefix for spool files
    $ActionQueueMaxDiskSpace 1g       # 1gb space limit (use as much as possible)
    $ActionQueueSaveOnShutdown on     # save messages to disk on shutdown
    $ActionQueueType LinkedList       # run asynchronously
    $ActionResumeRetryCount -1        # infinite retries if host is down

    #RsyslogGnuTLS
    $DefaultNetstreamDriverCAFile /etc/rsyslog.d/keys/CA-Bundle.pem

    template(name="G2Format" type="string"
    string="<%pri%>%protocol-version% %timestamp:::date-rfc3339% %HOSTNAME% %app-name% %procid% %msgid% [TOKEN@41058 tag=\"RsyslogTLS\"] %msg%\n"
    )

    # Send messages to Loggly over TCP using the template.
    action(type="omfwd" protocol="tcp" target="<DESTINATION_SERVER>.someone.com" port="<DESTINATION_SERVER_PORT>" template="G2Format" StreamDriver="gtls" StreamDriverMode="1" StreamDriverAuthMode="x509/name" StreamDriverPermittedPeers="*.<DESTINATION_SERVER_DOMAIN>.com")

 
 7. Increase the message size
    unix> sudo -s
    unix> cp /etc/rsyslog.conf /etc/rsyslog.conf.ORIG
    unix> vi /etc/rsyslog.conf
    
    # Add this line to it
    $MaxMessageSize 64k

 8. Restart the rsyslog service
    unix> sudo systemctl restart rsyslog.service
    
 9. Open a tail window
    unix> sudo tail -f /var/log/messages
    
    At this point, you are probably seeing this message in /var/log/messages (everytime you restart the rsyslog.service)s
    
    Mar  7 09:41:40 myCentos python: SELinux is preventing /usr/sbin/rsyslogd from name_connect access on the tcp_socket port 5014.#012#012*****  Plugin connect_ports (92.2 confidence) suggests   *********************#012#012If you want to allow /usr/sbin/rsyslogd to connect to network port 5014#012Then you need to modify the port type.#012Do#012# semanage port -a -t PORT_TYPE -p tcp 5014#012    where PORT_TYPE is one of the following: dns_port_t, dnssec_port_t, kerberos_port_t, mysqld_port_t, ocsp_port_t, postgresql_port_t, rsh_port_t, syslog_tls_port_t, syslogd_port_t.#012#012*****  Plugin catchall_boolean (7.83 confidence) suggests   ******************#012#012If you want to allow nis to enabled#012Then you must tell SELinux about this by enabling the 'nis_enabled' boolean.#012You can read 'None' man page for more details.#012Do#012setsebool -P nis_enabled 1#012#012*****  Plugin catchall (1.41 confidence) suggests   **************************#012#012If you believe that rsyslogd should be allowed name_connect access on the port 5014 tcp_socket by default.#012Then you should report this as a bug.#012You can generate a local policy module to allow this access.#012Do#012allow this access for now by executing:#012# ausearch -c '72733A6D61696E20513A526567' --raw | audit2allow -M my-72733A6D61696E20513A526567#012# semodule -i my-72733A6D61696E20513A526567.pp#012

10. Configure SELinux to allow your connections to get out of port 5014 (or change to your rsyslog port)
    a. Install the tools
       unix> sudo yum install policycoreutils setroubleshoot
        
    b. List existing open ports
       unix> sudo semanage port -l | grep syslog
       syslog_tls_port_t              tcp      6514
       syslog_tls_port_t              udp      6514
       syslogd_port_t                 tcp      601
       syslogd_port_t                 udp      514, 601

    c. Open up port 5014
       unix> sudo semanage port -a -t syslog_tls_port_t -p tcp 5014
   
    d. List existing open ports (you should now see the new port)
       syslog_tls_port_t              tcp      5014, 6514
       syslog_tls_port_t              udp      6514
       syslogd_port_t                 tcp      601
       syslogd_port_t                 udp      514, 601

11. Allow SE to authorize the /var/spool/rsyslog directory
    unix> sudo mkdir -p /var/spool/rsyslog
    unix> sudo semanage fcontext -a -t syslogd_var_lib_t "/var/spool/rsyslog/*"
    unix> sudo restorecon -R -v /var/spool/rsyslog

12. Restart the rsyslog service
    unix> sudo systemctl restart rsyslog.service

13. Verify it is working
    unix> sudo tail -f /var/log/messages
    
    If you see this message:
       rsyslogd: error: peer name not authorized -  not permitted to talk to it. 
    
    Then you have something wrong in your /etc/rsyslog.d/22-greylog.conf
    
    Possible Solutions:
     1) Your /etc/rsyslog.d/keys/CA-Bundle.pem is missing some intermedia certs
     2) Your StreamDriverPermittedPeers="..." has the wrong domain name
        For example,
        
        StreamDriverPermittedPeers="*.myCompany.com"     # Failed because myCompany.com is for external Internet only
        StreamDriverPermittedPeers="*.myCompany.net"     # Works because myCompany.net is for internal calls
        

    
